# while looop

In [1]:
error = 50.0

while error > 1 :
    error = error / 4
    print(error)

12.5
3.125
0.78125

# for loop

In [2]:
for char in "iqram":
    print(char.capitalize())

I
Q
R
A
M

In [3]:
fam = [1.73, 1.68, 1.71, 1.89]

for index, height in enumerate(fam) :
    print("person " + str(index) + ": " + str(height))

person 0: 1.73
person 1: 1.68
person 2: 1.71
person 3: 1.89

In [4]:
house = [["hallway", 11.25], 
         ["kitchen", 18.0], 
         ["living room", 20.0], 
         ["bedroom", 10.75], 
         ["bathroom", 9.50]]

In [5]:
type(house)

list

In [6]:
for x, y in house:
    print(f"the {x} is {y} sqm")

the hallway is 11.25 sqm
the kitchen is 18.0 sqm
the living room is 20.0 sqm
the bedroom is 10.75 sqm
the bathroom is 9.5 sqm

# Loop Data Structures

In [7]:
europe = {'spain':'madrid', 'france':'paris', 'germany':'berlin',
          'norway':'oslo', 'italy':'rome', 'poland':'warsaw', 'austria':'vienna' }

In [8]:
type(europe)

dict

In [9]:
for k, v in europe.items():
    print(f"the capital of {k} is {v}")

the capital of spain is madrid
the capital of france is paris
the capital of germany is berlin
the capital of norway is oslo
the capital of italy is rome
the capital of poland is warsaw
the capital of austria is vienna

In [10]:
import pandas as pd

In [11]:
names = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
dr =  [True, False, False, False, True, True, True]
cpc = [809, 731, 588, 18, 200, 70, 45]
row_labels = ['US', 'AUS', 'JPN', 'IN', 'RU', 'MOR', 'EG']


my_dict = {'country':names, 'drives_right':dr, 'cars_per_cap':cpc}
cars = pd.DataFrame(my_dict)
cars.index=row_labels

In [12]:
cars.head()

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JPN          Japan         False           588
IN           India         False            18
RU          Russia          True           200

In [13]:
for lab, row in cars.iterrows():
    print(lab)
    print(row)

US
country         United States
drives_right             True
cars_per_cap              809
Name: US, dtype: object
AUS
country         Australia
drives_right        False
cars_per_cap          731
Name: AUS, dtype: object
JPN
country         Japan
drives_right    False
cars_per_cap      588
Name: JPN, dtype: object
IN
country         India
drives_right    False
cars_per_cap       18
Name: IN, dtype: object
RU
country         Russia
drives_right      True
cars_per_cap       200
Name: RU, dtype: object
MOR
country         Morocco
drives_right       True
cars_per_cap         70
Name: MOR, dtype: object
EG
country         Egypt
drives_right     True
cars_per_cap       45
Name: EG, dtype: object

In [14]:
for lab, row in cars.iterrows():
    print(row['country'])

United States
Australia
Japan
India
Russia
Morocco
Egypt

In [15]:
for lab, row in cars.iterrows():
    print(row['cars_per_cap'])

809
731
588
18
200
70
45

In [16]:
for lab, row in cars.iterrows():
    print(lab)

US
AUS
JPN
IN
RU
MOR
EG

In [17]:
for lab, row in cars.iterrows() :
    print(f"{lab}: {row['cars_per_cap']}")

US: 809
AUS: 731
JPN: 588
IN: 18
RU: 200
MOR: 70
EG: 45

In [18]:
cars.head()

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JPN          Japan         False           588
IN           India         False            18
RU          Russia          True           200

In [19]:
for lab, row in cars.iterrows():
    cars.loc[lab, 'name_length'] = len(row['country'])

In [20]:
cars.head()

           country  drives_right  cars_per_cap  name_length
US   United States          True           809         13.0
AUS      Australia         False           731          9.0
JPN          Japan         False           588          5.0
IN           India         False            18          5.0
RU          Russia          True           200          6.0